[
    {
        "title": "",
        "img": { "src": "", "alt": "" },
        "description": ""
    },
    {
        "title": "Threaded Web Parser",
        "img": { "src": "./assets/img/threads.png", "alt": "Fun with C++" },
        "description": "As a project for Operating Systems (Spring '17), my sister and I wrote a web parser that leveraged the pthread library in C++. The program features a thread-safe queue-like data structure, instances of which can be chained together, forming a threaded pipeline of data.",
        "link": "https://github.com/wbadart/KeywordFinder"
    },
    {
        "title": "The Bald & the Beautfiful Site",
        "img": { "src": "./assets/img/tbab.png", "alt": "TBAB" },
        "description": "My first pro-bono freelance project, the new \"The Bald & the Beautfiful\" (TBAB) site was an excellent exercise in design principles and code simplicity. The latter was of particular importance since the site, now that it's complete, is maintained by individuals whose only exposure to web development is the handful of tips I gave them sending the files over.",
        "link": "http://nd.edu/~tbab"
    },
    {
        "title": "Remix Redesign Project",
        "img": { "src": "./assets/img/remix.png", "alt": "Remix" },
        "description": "Remix is a portal to bring digital literacy into the classroom. As it currently exists, Remix has three disparate branches, with no content or design continuity. This project is a small-team effort to unite all those branches into a single, modern site. My role as lead developer involves work on the full stack of the app. I built the first iteration of the new site on the LAMP stack, giving me some much needed practice in SQL. However, I have since ported the app to the MEAN stack."
    },
    {
        "title": "Undergraduate Research Opportunities in Computing",
        "img": { "src": "./assets/img/uroc.png", "alt": "UROC" },
        "description": "Connecting Notre Dame CSE faculty and their research to undergrads. The site is a job board of sorts, where faculty can create accounts and post openings in their labs and research projects. UROC has been a unique and fun opportunity for me to research and implement security features on a site with a good number of active users. The site also features a dynamic MVC architecture with real-time search and sort.",
        "link": "http://m-lab.cse.nd.edu:4000"
    },
    {
        "title": "Oracle Quest",
        "img": { "src": "./assets/img/oracle.png", "alt": "Oracle" },
        "description": "A study tool inspired by an assignment early in the Spring '16 semester. Challenges undertakers to find and decrypt a password which unlocks a quiz game. Built with Python, the program uses low level system calls to implement its two \"characters.\" Curly and The Oracle (the characters) are forking TCP servers which make heavy use of the Python socket module.",
        "link": "https://github.com/wbadart/Oracle"
    },
    {
        "title": "Panda3D Maze Game",
        "img": { "src": "./assets/img/dog.png", "alt": "a-maze-ing" },
        "description": "A small 3D maze game built on the Panda3D engine. Focused on taking advantage of OOP and features of C++11. This team effort was the culminating project of the Fundamentals of Computing II class (Spring '16). My work focused on implementing the class hierarchy, from the engine-wrapping \"Game\" class down to the abstract \"Object\" class and its children.",
        "link": "https://github.com/wbadart/Final-Project"
    },
    {
        "title": "Multimedia Portfolio",
        "img": { "src": "./assets/img/eportfolio.png", "alt": "ePortfolio" },
        "description": "Digication-based portfolio for my Applied Multimedia Technology class. The site features hundreds of custom CSS rules to help distinguish it from the \"default portfolio.\" Won the ePortfolio Excellence Award.",
        "link": "https://nd.digication.com/wbadart-media"
    }
]
